kcuzner/teensy-oscilloscope/scope-teensy/include/MKM38Z5.h
/* AFE - Register instance definitions */
/* AFE */
#define AFE_CH1_CFR                              AFE_CFR_REG(AFE_BASE_PTR,0)
#define AFE_CH2_CFR                              AFE_CFR_REG(AFE_BASE_PTR,1)
#define AFE_CH3_CFR                              AFE_CFR_REG(AFE_BASE_PTR,2)
#define AFE_CH4_CFR                              AFE_CFR_REG(AFE_BASE_PTR,3)
#define AFE_CR                                   AFE_CR_REG(AFE_BASE_PTR)
#define AFE_CKR                                  AFE_CKR_REG(AFE_BASE_PTR)
#define AFE_DI                                   AFE_DI_REG(AFE_BASE_PTR)
#define AFE_CH1_DR                               AFE_DR_REG(AFE_BASE_PTR,0)
#define AFE_CH2_DR                               AFE_DR_REG(AFE_BASE_PTR,1)
#define AFE_CH3_DR                               AFE_DR_REG(AFE_BASE_PTR,2)
#define AFE_CH4_DR                               AFE_DR_REG(AFE_BASE_PTR,3)
#define AFE_CH1_RR                               AFE_RR_REG(AFE_BASE_PTR,0)
#define AFE_CH2_RR                               AFE_RR_REG(AFE_BASE_PTR,1)
#define AFE_CH3_RR                               AFE_RR_REG(AFE_BASE_PTR,2)
#define AFE_CH4_RR                               AFE_RR_REG(AFE_BASE_PTR,3)
#define AFE_SR                                   AFE_SR_REG(AFE_BASE_PTR)

/* AFE - Register array accessors */
#define AFE_CFR(index)                           AFE_CFR_REG(AFE_BASE_PTR,index)
#define AFE_DR(index)                            AFE_DR_REG(AFE_BASE_PTR,index)
#define AFE_RR(index)                            AFE_RR_REG(AFE_BASE_PTR,index)

/**
 * @}
 */ /* end of group AFE_Register_Accessor_Macros */


/**
 * @}
 */ /* end of group AFE_Peripheral */


/* ----------------------------------------------------------------------------
   -- AIPS
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup AIPS_Peripheral AIPS
 * @{
 */

/** AIPS - Peripheral register structure */
typedef struct AIPS_MemMap {
  uint8_t RESERVED_0[32];
  uint32_t PACRA;                                  /**< Peripheral Access Control Register, offset: 0x20 */
  uint32_t PACRB;                                  /**< Peripheral Access Control Register, offset: 0x24 */
  uint32_t PACRC;                                  /**< Peripheral Access Control Register, offset: 0x28 */
  uint32_t PACRD;                                  /**< Peripheral Access Control Register, offset: 0x2C */
  uint8_t RESERVED_1[16];
  uint32_t PACRE;                                  /**< Peripheral Access Control Register, offset: 0x40 */
  uint32_t PACRF;                                  /**< Peripheral Access Control Register, offset: 0x44 */
  uint32_t PACRG;                                  /**< Peripheral Access Control Register, offset: 0x48 */
  uint32_t PACRH;                                  /**< Peripheral Access Control Register, offset: 0x4C */
  uint32_t PACRI;                                  /**< Peripheral Access Control Register, offset: 0x50 */
  uint32_t PACRJ;                                  /**< Peripheral Access Control Register, offset: 0x54 */
  uint32_t PACRK;                                  /**< Peripheral Access Control Register, offset: 0x58 */
  uint32_t PACRL;                                  /**< Peripheral Access Control Register, offset: 0x5C */
  uint32_t PACRM;                                  /**< Peripheral Access Control Register, offset: 0x60 */
  uint32_t PACRN;                                  /**< Peripheral Access Control Register, offset: 0x64 */
  uint32_t PACRO;                                  /**< Peripheral Access Control Register, offset: 0x68 */
  uint32_t PACRP;                                  /**< Peripheral Access Control Register, offset: 0x6C */
  uint8_t RESERVED_2[16];
  uint32_t PACRU;                                  /**< Peripheral Access Control Register, offset: 0x80 */
} volatile *AIPS_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- AIPS - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup AIPS_Register_Accessor_Macros AIPS - Register accessor macros
 * @{
 */


/* AIPS - Register accessors */
#define AIPS_PACRA_REG(base)                     ((base)->PACRA)
#define AIPS_PACRB_REG(base)                     ((base)->PACRB)
#define AIPS_PACRC_REG(base)                     ((base)->PACRC)
#define AIPS_PACRD_REG(base)                     ((base)->PACRD)
#define AIPS_PACRE_REG(base)                     ((base)->PACRE)
#define AIPS_PACRF_REG(base)                     ((base)->PACRF)
#define AIPS_PACRG_REG(base)                     ((base)->PACRG)
#define AIPS_PACRH_REG(base)                     ((base)->PACRH)
#define AIPS_PACRI_REG(base)                     ((base)->PACRI)
#define AIPS_PACRJ_REG(base)                     ((base)->PACRJ)
#define AIPS_PACRK_REG(base)                     ((base)->PACRK)
#define AIPS_PACRL_REG(base)                     ((base)->PACRL)
#define AIPS_PACRM_REG(base)                     ((base)->PACRM)
#define AIPS_PACRN_REG(base)                     ((base)->PACRN)
#define AIPS_PACRO_REG(base)                     ((base)->PACRO)
#define AIPS_PACRP_REG(base)                     ((base)->PACRP)
#define AIPS_PACRU_REG(base)                     ((base)->PACRU)

/**
 * @}
 */ /* end of group AIPS_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- AIPS Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup AIPS_Register_Masks AIPS Register Masks
 * @{
 */

/* PACRA Bit Fields */
#define AIPS_PACRA_AC7_MASK                      0x7u
#define AIPS_PACRA_AC7_SHIFT                     0
#define AIPS_PACRA_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC7_SHIFT))&AIPS_PACRA_AC7_MASK)
#define AIPS_PACRA_RO7_MASK                      0x8u
#define AIPS_PACRA_RO7_SHIFT                     3
#define AIPS_PACRA_AC6_MASK                      0x70u
#define AIPS_PACRA_AC6_SHIFT                     4
#define AIPS_PACRA_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC6_SHIFT))&AIPS_PACRA_AC6_MASK)
#define AIPS_PACRA_RO6_MASK                      0x80u
#define AIPS_PACRA_RO6_SHIFT                     7
#define AIPS_PACRA_AC5_MASK                      0x700u
#define AIPS_PACRA_AC5_SHIFT                     8
#define AIPS_PACRA_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC5_SHIFT))&AIPS_PACRA_AC5_MASK)
#define AIPS_PACRA_RO5_MASK                      0x800u
#define AIPS_PACRA_RO5_SHIFT                     11
#define AIPS_PACRA_AC4_MASK                      0x7000u
#define AIPS_PACRA_AC4_SHIFT                     12
#define AIPS_PACRA_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC4_SHIFT))&AIPS_PACRA_AC4_MASK)
#define AIPS_PACRA_RO4_MASK                      0x8000u
#define AIPS_PACRA_RO4_SHIFT                     15
#define AIPS_PACRA_AC3_MASK                      0x70000u
#define AIPS_PACRA_AC3_SHIFT                     16
#define AIPS_PACRA_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC3_SHIFT))&AIPS_PACRA_AC3_MASK)
#define AIPS_PACRA_RO3_MASK                      0x80000u
#define AIPS_PACRA_RO3_SHIFT                     19
#define AIPS_PACRA_AC2_MASK                      0x700000u
#define AIPS_PACRA_AC2_SHIFT                     20
#define AIPS_PACRA_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC2_SHIFT))&AIPS_PACRA_AC2_MASK)
#define AIPS_PACRA_RO2_MASK                      0x800000u
#define AIPS_PACRA_RO2_SHIFT                     23
#define AIPS_PACRA_AC1_MASK                      0x7000000u
#define AIPS_PACRA_AC1_SHIFT                     24
#define AIPS_PACRA_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC1_SHIFT))&AIPS_PACRA_AC1_MASK)
#define AIPS_PACRA_RO1_MASK                      0x8000000u
#define AIPS_PACRA_RO1_SHIFT                     27
#define AIPS_PACRA_AC0_MASK                      0x70000000u
#define AIPS_PACRA_AC0_SHIFT                     28
#define AIPS_PACRA_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC0_SHIFT))&AIPS_PACRA_AC0_MASK)
#define AIPS_PACRA_RO0_MASK                      0x80000000u
#define AIPS_PACRA_RO0_SHIFT                     31
/* PACRB Bit Fields */
#define AIPS_PACRB_AC7_MASK                      0x7u
#define AIPS_PACRB_AC7_SHIFT                     0
#define AIPS_PACRB_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC7_SHIFT))&AIPS_PACRB_AC7_MASK)
#define AIPS_PACRB_RO7_MASK                      0x8u
#define AIPS_PACRB_RO7_SHIFT                     3
#define AIPS_PACRB_AC6_MASK                      0x70u
#define AIPS_PACRB_AC6_SHIFT                     4
#define AIPS_PACRB_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC6_SHIFT))&AIPS_PACRB_AC6_MASK)
#define AIPS_PACRB_RO6_MASK                      0x80u
#define AIPS_PACRB_RO6_SHIFT                     7
#define AIPS_PACRB_AC5_MASK                      0x700u
#define AIPS_PACRB_AC5_SHIFT                     8
#define AIPS_PACRB_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC5_SHIFT))&AIPS_PACRB_AC5_MASK)
#define AIPS_PACRB_RO5_MASK                      0x800u
#define AIPS_PACRB_RO5_SHIFT                     11
#define AIPS_PACRB_AC4_MASK                      0x7000u
#define AIPS_PACRB_AC4_SHIFT                     12
#define AIPS_PACRB_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC4_SHIFT))&AIPS_PACRB_AC4_MASK)
#define AIPS_PACRB_RO4_MASK                      0x8000u
#define AIPS_PACRB_RO4_SHIFT                     15
#define AIPS_PACRB_AC3_MASK                      0x70000u
#define AIPS_PACRB_AC3_SHIFT                     16
#define AIPS_PACRB_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC3_SHIFT))&AIPS_PACRB_AC3_MASK)
#define AIPS_PACRB_RO3_MASK                      0x80000u
#define AIPS_PACRB_RO3_SHIFT                     19
#define AIPS_PACRB_AC2_MASK                      0x700000u
#define AIPS_PACRB_AC2_SHIFT                     20
#define AIPS_PACRB_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC2_SHIFT))&AIPS_PACRB_AC2_MASK)
#define AIPS_PACRB_RO2_MASK                      0x800000u
#define AIPS_PACRB_RO2_SHIFT                     23
#define AIPS_PACRB_AC1_MASK                      0x7000000u
#define AIPS_PACRB_AC1_SHIFT                     24
#define AIPS_PACRB_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC1_SHIFT))&AIPS_PACRB_AC1_MASK)
#define AIPS_PACRB_RO1_MASK                      0x8000000u
#define AIPS_PACRB_RO1_SHIFT                     27
#define AIPS_PACRB_AC0_MASK                      0x70000000u
#define AIPS_PACRB_AC0_SHIFT                     28
#define AIPS_PACRB_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC0_SHIFT))&AIPS_PACRB_AC0_MASK)
#define AIPS_PACRB_RO0_MASK                      0x80000000u
#define AIPS_PACRB_RO0_SHIFT                     31
/* PACRC Bit Fields */
#define AIPS_PACRC_AC7_MASK                      0x7u
#define AIPS_PACRC_AC7_SHIFT                     0
#define AIPS_PACRC_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRC_AC7_SHIFT))&AIPS_PACRC_AC7_MASK)
#define AIPS_PACRC_RO7_MASK                      0x8u
#define AIPS_PACRC_RO7_SHIFT                     3
#define AIPS_PACRC_AC6_MASK                      0x70u
#define AIPS_PACRC_AC6_SHIFT                     4
#define AIPS_PACRC_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRC_AC6_SHIFT))&AIPS_PACRC_AC6_MASK)
#define AIPS_PACRC_RO6_MASK                      0x80u
#define AIPS_PACRC_RO6_SHIFT                     7
#define AIPS_PACRC_AC5_MASK                      0x700u
#define AIPS_PACRC_AC5_SHIFT                     8
#define AIPS_PACRC_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRC_AC5_SHIFT))&AIPS_PACRC_AC5_MASK)
#define AIPS_PACRC_RO5_MASK                      0x800u
#define AIPS_PACRC_RO5_SHIFT                     11
#define AIPS_PACRC_AC4_MASK                      0x7000u
#define AIPS_PACRC_AC4_SHIFT                     12
#define AIPS_PACRC_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRC_AC4_SHIFT))&AIPS_PACRC_AC4_MASK)
#define AIPS_PACRC_RO4_MASK                      0x8000u
#define AIPS_PACRC_RO4_SHIFT                     15
#define AIPS_PACRC_AC3_MASK                      0x70000u
#define AIPS_PACRC_AC3_SHIFT                     16
#define AIPS_PACRC_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRC_AC3_SHIFT))&AIPS_PACRC_AC3_MASK)
#define AIPS_PACRC_RO3_MASK                      0x80000u
#define AIPS_PACRC_RO3_SHIFT                     19
#define AIPS_PACRC_AC2_MASK                      0x700000u
#define AIPS_PACRC_AC2_SHIFT                     20
#define AIPS_PACRC_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRC_AC2_SHIFT))&AIPS_PACRC_AC2_MASK)
#define AIPS_PACRC_RO2_MASK                      0x800000u
#define AIPS_PACRC_RO2_SHIFT                     23
#define AIPS_PACRC_AC1_MASK                      0x7000000u
#define AIPS_PACRC_AC1_SHIFT                     24
#define AIPS_PACRC_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRC_AC1_SHIFT))&AIPS_PACRC_AC1_MASK)
#define AIPS_PACRC_RO1_MASK                      0x8000000u
#define AIPS_PACRC_RO1_SHIFT                     27
#define AIPS_PACRC_AC0_MASK                      0x70000000u
#define AIPS_PACRC_AC0_SHIFT                     28
#define AIPS_PACRC_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRC_AC0_SHIFT))&AIPS_PACRC_AC0_MASK)
#define AIPS_PACRC_RO0_MASK                      0x80000000u
#define AIPS_PACRC_RO0_SHIFT                     31
/* PACRD Bit Fields */
#define AIPS_PACRD_AC7_MASK                      0x7u
#define AIPS_PACRD_AC7_SHIFT                     0
#define AIPS_PACRD_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRD_AC7_SHIFT))&AIPS_PACRD_AC7_MASK)
#define AIPS_PACRD_RO7_MASK                      0x8u
#define AIPS_PACRD_RO7_SHIFT                     3
#define AIPS_PACRD_AC6_MASK                      0x70u
#define AIPS_PACRD_AC6_SHIFT                     4
#define AIPS_PACRD_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRD_AC6_SHIFT))&AIPS_PACRD_AC6_MASK)
#define AIPS_PACRD_RO6_MASK                      0x80u
#define AIPS_PACRD_RO6_SHIFT                     7
#define AIPS_PACRD_AC5_MASK                      0x700u
#define AIPS_PACRD_AC5_SHIFT                     8
#define AIPS_PACRD_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRD_AC5_SHIFT))&AIPS_PACRD_AC5_MASK)
#define AIPS_PACRD_RO5_MASK                      0x800u
#define AIPS_PACRD_RO5_SHIFT                     11
#define AIPS_PACRD_AC4_MASK                      0x7000u
#define AIPS_PACRD_AC4_SHIFT                     12
#define AIPS_PACRD_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRD_AC4_SHIFT))&AIPS_PACRD_AC4_MASK)
#define AIPS_PACRD_RO4_MASK                      0x8000u
#define AIPS_PACRD_RO4_SHIFT                     15
#define AIPS_PACRD_AC3_MASK                      0x70000u
#define AIPS_PACRD_AC3_SHIFT                     16
#define AIPS_PACRD_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRD_AC3_SHIFT))&AIPS_PACRD_AC3_MASK)
#define AIPS_PACRD_RO3_MASK                      0x80000u
#define AIPS_PACRD_RO3_SHIFT                     19
#define AIPS_PACRD_AC2_MASK                      0x700000u
#define AIPS_PACRD_AC2_SHIFT                     20
#define AIPS_PACRD_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRD_AC2_SHIFT))&AIPS_PACRD_AC2_MASK)
#define AIPS_PACRD_RO2_MASK                      0x800000u
#define AIPS_PACRD_RO2_SHIFT                     23
#define AIPS_PACRD_AC1_MASK                      0x7000000u
#define AIPS_PACRD_AC1_SHIFT                     24
#define AIPS_PACRD_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRD_AC1_SHIFT))&AIPS_PACRD_AC1_MASK)
#define AIPS_PACRD_RO1_MASK                      0x8000000u
#define AIPS_PACRD_RO1_SHIFT                     27
#define AIPS_PACRD_AC0_MASK                      0x70000000u
#define AIPS_PACRD_AC0_SHIFT                     28
#define AIPS_PACRD_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRD_AC0_SHIFT))&AIPS_PACRD_AC0_MASK)
#define AIPS_PACRD_RO0_MASK                      0x80000000u
#define AIPS_PACRD_RO0_SHIFT                     31
/* PACRE Bit Fields */
#define AIPS_PACRE_AC7_MASK                      0x7u
#define AIPS_PACRE_AC7_SHIFT                     0
#define AIPS_PACRE_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC7_SHIFT))&AIPS_PACRE_AC7_MASK)
#define AIPS_PACRE_RO7_MASK                      0x8u
#define AIPS_PACRE_RO7_SHIFT                     3
#define AIPS_PACRE_AC6_MASK                      0x70u
#define AIPS_PACRE_AC6_SHIFT                     4
#define AIPS_PACRE_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC6_SHIFT))&AIPS_PACRE_AC6_MASK)
#define AIPS_PACRE_RO6_MASK                      0x80u
#define AIPS_PACRE_RO6_SHIFT                     7
#define AIPS_PACRE_AC5_MASK                      0x700u
#define AIPS_PACRE_AC5_SHIFT                     8
#define AIPS_PACRE_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC5_SHIFT))&AIPS_PACRE_AC5_MASK)
#define AIPS_PACRE_RO5_MASK                      0x800u
#define AIPS_PACRE_RO5_SHIFT                     11
#define AIPS_PACRE_AC4_MASK                      0x7000u
#define AIPS_PACRE_AC4_SHIFT                     12
#define AIPS_PACRE_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC4_SHIFT))&AIPS_PACRE_AC4_MASK)
#define AIPS_PACRE_RO4_MASK                      0x8000u
#define AIPS_PACRE_RO4_SHIFT                     15
#define AIPS_PACRE_AC3_MASK                      0x70000u
#define AIPS_PACRE_AC3_SHIFT                     16
#define AIPS_PACRE_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC3_SHIFT))&AIPS_PACRE_AC3_MASK)
#define AIPS_PACRE_RO3_MASK                      0x80000u
#define AIPS_PACRE_RO3_SHIFT                     19
#define AIPS_PACRE_AC2_MASK                      0x700000u
#define AIPS_PACRE_AC2_SHIFT                     20
#define AIPS_PACRE_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC2_SHIFT))&AIPS_PACRE_AC2_MASK)
#define AIPS_PACRE_RO2_MASK                      0x800000u
#define AIPS_PACRE_RO2_SHIFT                     23
#define AIPS_PACRE_AC1_MASK                      0x7000000u
#define AIPS_PACRE_AC1_SHIFT                     24
#define AIPS_PACRE_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC1_SHIFT))&AIPS_PACRE_AC1_MASK)
#define AIPS_PACRE_RO1_MASK                      0x8000000u
#define AIPS_PACRE_RO1_SHIFT                     27
#define AIPS_PACRE_AC0_MASK                      0x70000000u
#define AIPS_PACRE_AC0_SHIFT                     28
#define AIPS_PACRE_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC0_SHIFT))&AIPS_PACRE_AC0_MASK)
#define AIPS_PACRE_RO0_MASK                      0x80000000u
#define AIPS_PACRE_RO0_SHIFT                     31
/* PACRF Bit Fields */
#define AIPS_PACRF_AC7_MASK                      0x7u
#define AIPS_PACRF_AC7_SHIFT                     0
#define AIPS_PACRF_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC7_SHIFT))&AIPS_PACRF_AC7_MASK)
#define AIPS_PACRF_RO7_MASK                      0x8u
#define AIPS_PACRF_RO7_SHIFT                     3
#define AIPS_PACRF_AC6_MASK                      0x70u
#define AIPS_PACRF_AC6_SHIFT                     4
#define AIPS_PACRF_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC6_SHIFT))&AIPS_PACRF_AC6_MASK)
#define AIPS_PACRF_RO6_MASK                      0x80u
#define AIPS_PACRF_RO6_SHIFT                     7
#define AIPS_PACRF_AC5_MASK                      0x700u
#define AIPS_PACRF_AC5_SHIFT                     8
#define AIPS_PACRF_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC5_SHIFT))&AIPS_PACRF_AC5_MASK)
#define AIPS_PACRF_RO5_MASK                      0x800u
#define AIPS_PACRF_RO5_SHIFT                     11
#define AIPS_PACRF_AC4_MASK                      0x7000u
#define AIPS_PACRF_AC4_SHIFT                     12
#define AIPS_PACRF_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC4_SHIFT))&AIPS_PACRF_AC4_MASK)
#define AIPS_PACRF_RO4_MASK                      0x8000u
#define AIPS_PACRF_RO4_SHIFT                     15
#define AIPS_PACRF_AC3_MASK                      0x70000u
#define AIPS_PACRF_AC3_SHIFT                     16
#define AIPS_PACRF_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC3_SHIFT))&AIPS_PACRF_AC3_MASK)
#define AIPS_PACRF_RO3_MASK                      0x80000u
#define AIPS_PACRF_RO3_SHIFT                     19
#define AIPS_PACRF_AC2_MASK                      0x700000u
#define AIPS_PACRF_AC2_SHIFT                     20
#define AIPS_PACRF_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC2_SHIFT))&AIPS_PACRF_AC2_MASK)
#define AIPS_PACRF_RO2_MASK                      0x800000u
#define AIPS_PACRF_RO2_SHIFT                     23
#define AIPS_PACRF_AC1_MASK                      0x7000000u
#define AIPS_PACRF_AC1_SHIFT                     24
#define AIPS_PACRF_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC1_SHIFT))&AIPS_PACRF_AC1_MASK)
#define AIPS_PACRF_RO1_MASK                      0x8000000u
#define AIPS_PACRF_RO1_SHIFT                     27
#define AIPS_PACRF_AC0_MASK                      0x70000000u
#define AIPS_PACRF_AC0_SHIFT                     28
#define AIPS_PACRF_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC0_SHIFT))&AIPS_PACRF_AC0_MASK)
#define AIPS_PACRF_RO0_MASK                      0x80000000u
#define AIPS_PACRF_RO0_SHIFT                     31
/* PACRG Bit Fields */
#define AIPS_PACRG_AC7_MASK                      0x7u
#define AIPS_PACRG_AC7_SHIFT                     0
#define AIPS_PACRG_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_AC7_SHIFT))&AIPS_PACRG_AC7_MASK)
#define AIPS_PACRG_RO7_MASK                      0x8u
#define AIPS_PACRG_RO7_SHIFT                     3
#define AIPS_PACRG_AC6_MASK                      0x70u
#define AIPS_PACRG_AC6_SHIFT                     4
#define AIPS_PACRG_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_AC6_SHIFT))&AIPS_PACRG_AC6_MASK)
#define AIPS_PACRG_RO6_MASK                      0x80u
#define AIPS_PACRG_RO6_SHIFT                     7
#define AIPS_PACRG_AC5_MASK                      0x700u
#define AIPS_PACRG_AC5_SHIFT                     8
#define AIPS_PACRG_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_AC5_SHIFT))&AIPS_PACRG_AC5_MASK)
#define AIPS_PACRG_RO5_MASK                      0x800u
#define AIPS_PACRG_RO5_SHIFT                     11
#define AIPS_PACRG_AC4_MASK                      0x7000u
#define AIPS_PACRG_AC4_SHIFT                     12
#define AIPS_PACRG_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_AC4_SHIFT))&AIPS_PACRG_AC4_MASK)
#define AIPS_PACRG_RO4_MASK                      0x8000u
#define AIPS_PACRG_RO4_SHIFT                     15
#define AIPS_PACRG_AC3_MASK                      0x70000u
